//Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
//a = 5; b = 7 -> max = 7

int a = 5;
int b = 7;
int max = a;
if (b>max) max=b;
Console.WriteLine (max);


//Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
//a = 2; b = 10 -> max = 10

// int a = 2;
// int b = 10;
// int max = a;
// if (b>max) max=b;
// Console.WriteLine (max);


//Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
//a = -9; b = -3 -> max = -3

// int a = -9;
// int b = -3;
// int max = a;
// if (b>max) max=b;
// Console.WriteLine (max);